app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles"
---
  def index
    respond_with(@articles = Article.all)

SELECT "articles".* FROM "articles" WHERE "articles"."id" = 1 LIMIT 1
---
  def show
    respond_with(@article = Article.find(params[:id]))

INSERT INTO "articles" ("title", "updated_at", "body", "created_at") VALUES ('Dolor in Scattering', '2011-03-22 16:44:26.080729', 'Iron Mountain Daily News printed a front page article with photograph of the technology consultants that worked so busily to put in a new space-age computer lab. Although, the full-time staff had most of that time off and I set up the computers so I just needed a Sharpie to fix it.', '2011-03-22 16:44:26.080729')
---
  def create
    authorize! :create, @article
    @article = Article.create(params[:article].merge({ :user => current_user }))